app/controllers/authentication_controller.rb

SELECT * FROM `message_types` WHERE (`message_types`.`description` = 'customer message') LIMIT 1
INSERT INTO `customers` (`last_name`, `created_at`, `date_of_birth`, `first_name`, `updated_at`) VALUES('Bandawe', '2013-01-20 20:05:04', NULL, 'White', '2013-01-20 20:05:04')
INSERT INTO `customer_messages` (`created_at`, `message`, `customer_id`, `message_id`, `updated_at`) VALUES('2013-01-20 20:05:04', 'Please help me with the fonts on this page. I am not able to view properly what I want.', 26, 1, '2013-01-20 20:05:04')
INSERT INTO `titles` (`title`, `updated_at`, `customer_message_id`, `created_at`) VALUES('Title', '2013-01-20 15:22:30', 3, '2013-01-20 15:22:30')
---
	def add_blog
		cp = MessageType.find_by_description("customer message").id
		cust = Customer.new
		cust.first_name = params["name"].split(" ").first
		cust.last_name = params["name"].split(" ").last
		cust.save
		mess = CustomerMessage.new
		mess.message_id = cp
		mess.customer_id = cust.id
		mess.message = params["message"]
		mess.save
		title = Title.new
		title.customer_message_id = mess.id
		title.title = params["title"]
		title.save